/*********************
スイッチを1回押すと，モータが動き，もう一回押すとモータが止まるプログラム．
mbed研修の課題2－1
**********************/
/**********************************************************************
Include Libraries
**********************************************************************/
#include "mbed.h"
#include "dc_motor_1.h"
#define CONTROL_CYCLE 0.02f
/**********************************************************************
Declare Instances
**********************************************************************/
DigitalIn SW(A1);
dc_motor_1 M0(D3, D8, 0);
Serial PC(USBTX, USBRX, 115200);
/**********************************************************************
Declare variables
**********************************************************************/
Timer control_ticker;
int a = 0;
bool b = 0;
float motor_cycleout = 30.0;
/**********************************************************************
Main
**********************************************************************/
int main()
{
    control_ticker.start();
    while (1)
    {
        if (control_ticker.read() >= CONTROL_CYCLE)
        {
            control_ticker.reset();

            if (SW.read() == 0 && a == 1) //LEDちかのプログラムの使いまわしです．．．．
            {
                b = !b; //反転させる
            }
            a = SW.read();
            M0.drive(float(b) * motor_cycleout); //0*30か1*30になる
        }
    }
}
